       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEONCIO.
       AUTHOR. Pica Pau Comunista
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-TEMPORIZADOR              PIC 9(5) VALUE ZEROS.
       77 WS-DIVISAO                   PIC 9(5) VALUE ZEROS.
       77 WS-RESTO                     PIC 9(5) VALUE ZEROS.

       SCREEN SECTION.
       01 TELA-01.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWWWNWMMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWNWMWWWWMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWNWWWWWWMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWWWWWNKO00OKWMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMWXKKNWWWNOxddoccOWMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMW0xOOOOkkO0O0OdlllkNMMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMXdkMMKdl;:o0N0od0Kx0MMMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMN0O00KXNWMMMMMMMMMWkdNMNX0odxxxc'c0Xdd0XWM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMXxodooxO00000KNWMMMMXoxNMMMNOddlldloO000OkO"
               LINE 10 COLUMN 01. 
           05 VALUE "K0KNMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMWXdlk0K0OOOO0O0OOOO0XXkdxXWMMN0odO00kdOWMMWxd"
               LINE 11 COLUMN 01. 
           05 VALUE "XKOkONMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMWKkkk0XKOOO0000OO00OOxlok0NMMWWNxxXWMMMMXkxddolx"
               LINE 12 COLUMN 01. 
           05 VALUE "KNM0lOMMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MMNOookNWMMWNX000K000OkloXWWMMMMMKldNMMMMXOkkxxkkk"
               LINE 13 COLUMN 01. 
           05 VALUE "ddOolXMMMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "MMMMWKkxxKNWWMMMMWXKK0OodXWMMMMMMW0ox0OxxxONXxodkO"
               LINE 14 COLUMN 01. 
           05 VALUE "Okxx0WMMMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMMMMNkxkkkk0XNNXXNWKxdO0KKNWMMMW0oldOKXXOkOKWMM"
               LINE 15 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMMMMMMMMWWWKOkkOOkxoxKWWWWNWMMMMMMWWXKOOxcdKNMMM"
               LINE 16 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 16 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMXocOWMMMMMMMMMMMMMMWNXWWKooO0kk"
               LINE 17 COLUMN 01. 
           05 VALUE "0KO0WWMMMMMMMMMMMMMMMMMMMMMMMM" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMXOxxKWMMMMMMMMMMMMMMMMMMMMMNkxxoO"
               LINE 18 COLUMN 01. 
           05 VALUE "WW0lx0OO0XWMMMMMMMMMMMMMMMMMMM" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMNkxONMMMMMMMMMMMMMMMMMMMMMMMMMWk::d"
               LINE 19 COLUMN 01. 
           05 VALUE "OOodXMKodkxKMMMMMMMMMMMMMMMMMM" LINE 19 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMW0xONWWMMMMMMMMMMMMMWKONMMMMMMMWXKdo0"
               LINE 20 COLUMN 01. 
           05 VALUE "00OOOxxOKOokKNMMMMMMMMMMMMMMMM" LINE 20 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMWOdXWMMMMMMMMMMMMMMMXkxKWMMMMMMMWXKOdk"
               LINE 21 COLUMN 01. 
           05 VALUE "kOKXOloxod0X00000KXXNWMMMMMMMM" LINE 21 COLUMN 51.
           05 VALUE "MMMMMMMMMMMM0o0MWMMMWWMWNNWMMWXOx0NMMMMMMMMMMMMMWK"
               LINE 22 COLUMN 01. 
           05 VALUE "Oxdk0KNXdoO0O0KKXXK000OXMMMMMM" LINE 22 COLUMN 51.
           05 VALUE "000000KKXNNWOoKMMMMMMWMWKOO00kxONMMMMMMMMMMMMMMMMM"
               LINE 23 COLUMN 01. 
           05 VALUE "MW0kkO0kkXMWXK00000K0kxXMMMMMM" LINE 23 COLUMN 51.
           05 VALUE "NXK0Okxxddxxl;OMMMMMMMMMMWXxcxNMMMMMMMMMMMMMMMMMMM"
               LINE 24 COLUMN 01. 
           05 VALUE "MMMNkcxXWMMMMMMMWXKK0KWMWWNNNN" LINE 24 COLUMN 51.
       01 TELA-02.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMNKXWWMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMN0KNWMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWNX00XMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWKOKNXKOOO00OKWMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMWXK0odNWWWOl:lllOWMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMW0xOOOdloxOOOxlcddkNMMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMXdOMM0dl::d0N0odOKx0MMMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMN0O00KXNWMMMMMMMMMWkdNMNX0ooxxxc'c0Xdd0XWM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMXxodooxO00000KNWMMMMXoxNMMMNOddlldloO000OkO"
               LINE 10 COLUMN 01. 
           05 VALUE "K0KNMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMWXdlk0K0OOOOOO0OOOO0XXkdxXWMMN0odO00kdOWMMNxd"
               LINE 11 COLUMN 01. 
           05 VALUE "XKOkONMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMWKkkk0XKOOO0000OO00OOxlok0NMMWMNxxXWMMMMXkxddoox"
               LINE 12 COLUMN 01. 
           05 VALUE "KNM0lOMMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MMNOookNWMMMNX000K000OkloXWMMMMMMKldNMMMMXOOkxkkkk"
               LINE 13 COLUMN 01. 
           05 VALUE "ddOooXMMMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "MMMMWKkxxKNWWMMMMWXKK0OodXWMMMMMMW0ox0OxxxONXxodkO"
               LINE 14 COLUMN 01. 
           05 VALUE "OkxxKWMMMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMMMMNkxkkkk0XNNXXNWKxdO0KKNWMMMW0old0KXXOkOKWMM"
               LINE 15 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMMMMMMMMWWWKOkkOOkxoxKNWWWNWMMMMMMWWXKOOxcdKNMMM"
               LINE 16 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 16 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMXocOWMMMMMMMMMMMMMMWNNWWKooO0kk"
               LINE 17 COLUMN 01. 
           05 VALUE "0KO0WWMMMMMMMMMMMMMMMMMMMMMMMM" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMXkxxKWMMMMMMMMMMMMMMMMMMMMMNkxxoO"
               LINE 18 COLUMN 01. 
           05 VALUE "WW0lx0OOKXWMMMMMMMMMMMMMMMMMMM" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMNkxONMMMMMMMMMMMMMMMMMMMMMMMMMWk::d"
               LINE 19 COLUMN 01. 
           05 VALUE "OOodXMKodkxKMMMMMMMMMMMMMMMMMM" LINE 19 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMW0xONWWWMMMMMMMMMMMMWKONMMMMMMMWNKdo0"
               LINE 20 COLUMN 01. 
           05 VALUE "00OOOxxOKOokKNMMMMMMMMMMMMMMMM" LINE 20 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMWkdXWWMMMMMMMMMMMMMWXkxKWMMMMMMMWXKOdk"
               LINE 21 COLUMN 01. 
           05 VALUE "kOKXOloxod0X00000KXXNWMMMMMMMM" LINE 21 COLUMN 51.
           05 VALUE "MMMMMMMMMMMM0o0MWMMMMMMWNNWMMMXOxONMMMMMMMMMMMMMNK"
               LINE 22 COLUMN 01. 
           05 VALUE "Oxdk0KNXdoO0O0KKXXKK0OOXMMMMMM" LINE 22 COLUMN 51.
           05 VALUE "000000KKXNWWOoKMWWMMMMMWX0O00kxONMMMMMMMMMMMMMMMMM"
               LINE 23 COLUMN 01. 
           05 VALUE "MW0kkO0kkXMWXK00000K0kkXMMMMMM" LINE 23 COLUMN 51.
           05 VALUE "NXK0Okxxdxxkl;OMMMMMMMMMMWXxcxNMWMMMMMMMMMMMMMMMMM"
               LINE 24 COLUMN 01. 
           05 VALUE "MMMNkcxXWMMMMMMMWXKK0KWMMWNNNN" LINE 24 COLUMN 51.
       01 TELA-03.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWXXWMMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMN0KWMMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMXOKWMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWN0XWMMMMMMMMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWWWWWWWMMMMMMMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWX0KXXXXNXNMWNNMMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWKxk00000koookOk0NMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMW0OX0dodccx00klckxkNMM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMNkxOOO00KNWMMMMMMMMMMWdxWKc;lclxKXNko0xkNWM"
               LINE 10 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMMMk:okxxk0OO0OO0KNMMMMMWxoNWXOdx0Oo:kkoxkk00O"
               LINE 11 COLUMN 01. 
           05 VALUE "OXMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMMMMMNxlxkddkOO00000OOOOKWNOdkNMMMKdlolcddckWMMMN"
               LINE 12 COLUMN 01. 
           05 VALUE "do000NMMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MMWX0OkONWX0O0OxddkO00OkdodkOXWMWWKkkOKXXK0OkkO00O"
               LINE 13 COLUMN 01. 
           05 VALUE "k0WNOdOWMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "MMNOdkkxOXWMMWNKK000OkxolkKWMMMMM0lOWWMWWWWWXOkkO0"
               LINE 14 COLUMN 01. 
           05 VALUE "KXNW0lxWMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMMMN0xxOOkOXNWMMWNXkcOWWMMMMMMKoONK0kxxkOOkOOOO"
               LINE 15 COLUMN 01. 
           05 VALUE "dcoxoxNMMMMMMMMMMMMMMMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMMMMMMMWWN0kxdxxO0KOxxkKNWWMMMMNxdOkkKNNXKKOld00"
               LINE 16 COLUMN 01. 
           05 VALUE "O0XWXKXWMMMMMMMMMMMMMMMMMMMMMM" LINE 16 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMNX0ko:oKWX0OKWMMMMMNNWMMMWWNKOocx0O"
               LINE 17 COLUMN 01. 
           05 VALUE "0KN0xkkk0KO0NNNWMMMMMMMMMMMMMM" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMWXOkkxkKNWMMMMMMMMMMMMMMMWNXK0XNOxkO"
               LINE 18 COLUMN 01. 
           05 VALUE "00klkWWxlk0xokOkOXMMMMMMMMMMMM" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMNOkkOKNWMMMMMMMMMMMMMMMMMMMMMMMMMMW0lo"
               LINE 19 COLUMN 01. 
           05 VALUE "kkdlxKKdkWM0dKMNOd0WWMMMMMMMMM" LINE 19 COLUMN 51.
           05 VALUE "MMMMMMMMMMXkxOXWWWMMMMMMMMMMMMMMMMWNWMMMMMMMMMMW0o"
               LINE 20 COLUMN 01. 
           05 VALUE "old00K0kO0klxNMNkdO000000KXWMM" LINE 20 COLUMN 51.
           05 VALUE "MMMMMMMMNOdkNWWWMWWWWMMMMMMMMMMMWKk0WMMMMMMMMMMMNd"
               LINE 21 COLUMN 01. 
           05 VALUE "odOWWX00OddkkkkllOKXXXKK0OdkWM" LINE 21 COLUMN 51.
           05 VALUE "MMMMMMMKxkXWWMMMMWX000K0KXWMMWXOkkKWMMMMMMMMMMMMW0"
               LINE 22 COLUMN 01. 
           05 VALUE "xxkXMWNKkk0K0xoxKK00000KK0O0WM" LINE 22 COLUMN 51.
           05 VALUE "0000000oxWWWMMMMMMWWWWXOxodkOdloONWMMMMMMMMMMMMMMM"
               LINE 23 COLUMN 01. 
           05 VALUE "MNOxKMMMMXOdodKMMMMMMMMMMMMMMM" LINE 23 COLUMN 51.
           05 VALUE "NXK0OkdcOWWMMMMWMMWWWW0xxO00K0OxddkXWMMMMMMMMMMMMM"
               LINE 24 COLUMN 01. 
           05 VALUE "MMWkdKNX0kdd0WMMMMMMMMMMWWNNNN" LINE 24 COLUMN 51.
       01 TELA-04.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWXKXKXWMMMMMMMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMOdXWXkOXNMMMMMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMOdXMWOdkXMNXXWMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMWXOOkolddoxOkdx0kONMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMOoOOd:;:lk0KkccOxkNMM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMNOxOOO00KNWMMMMMMMMMMWdxWKc,:clxKNNOx0xkNWM"
               LINE 10 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMMMO:lkxxkOO00OO0KNMMMMMWxoNWXOdx0Oo:xOoxkk00O"
               LINE 11 COLUMN 01. 
           05 VALUE "OXMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMMMMMNxlxkddkOOO0000OOOOKNN0okNMMMKdlolcddckWMMMN"
               LINE 12 COLUMN 01. 
           05 VALUE "doO00NMMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MMWX0OkONWX0O0Oxdxk00OOkxodkkKWMWWKkkOKXXK0OkkO00O"
               LINE 13 COLUMN 01. 
           05 VALUE "k0WX0dOWMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "MMWOdxkxOXWMMWNK0000OkxolkKWMMMMM0lkWMMWWWWWXOkkO0"
               LINE 14 COLUMN 01. 
           05 VALUE "KXNWKoxWMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMMMNKxdOOkOXNWMMWNXklkWWMMMMMMKokNX0kxxkOOkOOOO"
               LINE 15 COLUMN 01. 
           05 VALUE "dcoxoxNMMMMMMMMMMMMMMMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMMMMMMMWNN0kxdxkO0KOxxkKXWWMMMMNxdkkx0XNXKXOod00"
               LINE 16 COLUMN 01. 
           05 VALUE "O0XWXKNWMMMMMMMMMMMMMMMMMMMMMM" LINE 16 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMNX0Oo:o0WX0OKWMMMMMNNWWMMMWNKOdcx0O"
               LINE 17 COLUMN 01. 
           05 VALUE "0KN0xOOk0KO0NWNWMMMMMMMMMMMMMM" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMWXOkkxk0NWMMMMMMMMMMMMMMMWNXK0KNOxkO"
               LINE 18 COLUMN 01. 
           05 VALUE "00klxWWxlk0xokOkOXMMMMMMMMMMMM" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMN0kkOKNWMMMMMMMMMMMMMMMMMMMMWMMMMMW0lo"
               LINE 19 COLUMN 01. 
           05 VALUE "kkdldXKdkWM0dKMNOd0WWMMMMMMMMM" LINE 19 COLUMN 51.
           05 VALUE "MMMMMMMMMMNkxOXWWWMMMMMMMMMMMMMMMMWNWMMMMMMMMMMW0o"
               LINE 20 COLUMN 01. 
           05 VALUE "ocdO0K0kO0klxNWNkoO00000KKXWMM" LINE 20 COLUMN 51.
           05 VALUE "MMMMMMMMNOdkNMWWMWWWWMMMMMMMMMMMWXkOWMMMMMMMMMMMNd"
               LINE 21 COLUMN 01. 
           05 VALUE "odOWWX00OddkkkkllkKXXXKK0OdkWM" LINE 21 COLUMN 51.
           05 VALUE "MMMMMMMKdkXWMMMMMWK000K0KNWMMWXOkk0WMMMMMMMMMMMMW0"
               LINE 22 COLUMN 01. 
           05 VALUE "xxkXMWNKkkOK0xlx0K00000K00O0WM" LINE 22 COLUMN 51.
           05 VALUE "0000000oxWWWWMMMMWWWWWXOxodkOdloONWMMMMMMMMMMMMMMM"
               LINE 23 COLUMN 01. 
           05 VALUE "MNOxKMMMMXOdoo0WMMMMMMMMMMMMMM" LINE 23 COLUMN 51.
           05 VALUE "NXK0OkdckMWMMMMWWWWWWW0xxO00K0OxddkXWMMMMMMMMMMMMM"
               LINE 24 COLUMN 01. 
           05 VALUE "MMWkdKNX0kdd0WMMMMMMMMMMMWNNNN" LINE 24 COLUMN 51.
       01 TELA-05.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMKx0WMKdl0MMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWK0XX00XWMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 10 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 11 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMN0OOO00KNWMMMMMMMMMMMMM"
               LINE 12 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MWMMMMMMMMMMMMMMMMMMMMMMMMKdk0KK0doodkO00OkOKNMMMM"
               LINE 13 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "MMMMMMMN0OkkOO0OOOO000KKXNxdNMMNOxxocoOKK0kl:dk0NM"
               LINE 14 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMMMM0clxxkO000000000kxdllkXWWNN0kOkddxxdoldOOXM"
               LINE 15 COLUMN 01. 
           05 VALUE "MMMMMMMNK0K0000KXXXXWMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMMMMMXo:oddxkkkOOkddkOO0KNNWMMN00OO0OxddolcdKXOk"
               LINE 16 COLUMN 01. 
           05 VALUE "O0OKWMXxx00xlk0OdokOxONWWNK000" LINE 16 COLUMN 51.
           05 VALUE "MMMMMMMNdd00000000kdxKWWMWWWWWKOOO00OOddO0KXXNXdoK"
               LINE 17 COLUMN 01. 
           05 VALUE "WN0dd0OooKMNxdKNKoOWKoxK000KX0" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMNxcx0XXK0O00kdOKKXWWMMKxkXWMWMMW0xxOKKK00O0N"
               LINE 18 COLUMN 01. 
           05 VALUE "MWXlckK0ooKXK0KXOlxKkoxKK00OOO" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMWKklcdkO0KNNWWWNNXNWMM0lokOOdxOO0OkkOK0OOO00"
               LINE 19 COLUMN 01. 
           05 VALUE "00ddkdoccONNXXKKOllkO0dlOKKXWM" LINE 19 COLUMN 51.
           05 VALUE "MMWNKOkkkOXWWWWXXXKKKKKKKKKKK0kOOkllxlcdxdk00OOkkx"
               LINE 20 COLUMN 01. 
           05 VALUE "lckNMKdoxk00OOO000OXWKodNMMMMM" LINE 20 COLUMN 51.
           05 VALUE "OOOkodxOKXX0kOO0KKKXXXXNNXXK00O00xoddlcodOWMMMMMWM"
               LINE 21 COLUMN 01. 
           05 VALUE "0dKMW0ONWNK00KNWMMMMWKoxWMMMMM" LINE 21 COLUMN 51.
           05 VALUE "KXWWNWWWWWWKk0NWMWWWMWKkO0KK00OokNKKKKXNNWMMMMMMMM"
               LINE 22 COLUMN 01. 
           05 VALUE "0lxXWWWMMMMMMMMMMMMMWOd0WMMMMM" LINE 22 COLUMN 51.
           05 VALUE "WWWWMMMMMMMMMWWWMMMMMWKxkOKXKK0KNWMMMMMMMMMMMMMMMW"
               LINE 23 COLUMN 01. 
           05 VALUE "OokkONMMMMMMMMMMWNKOkkXMMMMMMM" LINE 23 COLUMN 51.
           05 VALUE "WWWMMMMWWWMMMMWWMMMMMWMWKkxkXWWWWWMMMMMMMMMMMMMMMK"
               LINE 24 COLUMN 01. 
           05 VALUE "dOWNxxWMMMMMWNX0xddkXMMMWWWNNN" LINE 24 COLUMN 51.
       01 TELA-06.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 10 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 11 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMN0OOO00KNWMMMMMMMMMMMMM"
               LINE 12 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMKdk0KK0xoodkO00OkOKNWMMM"
               LINE 13 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "MMMMMMMN0OkkO00OOOO000KKXNxdNMMNkxxocoOKK0kc:dk0NM"
               LINE 14 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMMMMOclxxkO000000000kxdllkXWWNX0kOkdxxxdoldOOXM"
               LINE 15 COLUMN 01. 
           05 VALUE "MMMMMMMNK0K0000KXXXXWMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMMMMMNo:oddxkkkOOkddkOO0KNNWMMN000O0OxxdolcdKXOk"
               LINE 16 COLUMN 01. 
           05 VALUE "OOOKWMXxxO0xlk0OdoOOxONWWNK00O" LINE 16 COLUMN 51.
           05 VALUE "MMMMMMMNdd00000000koxKWMWWWWWWKOOO00OkdxO0KXXNXdoK"
               LINE 17 COLUMN 01. 
           05 VALUE "WN0dd0OooKMNxdKN0oOMKoxK000KX0" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMNxcx0XXK0OO0kdOKKXWWWWKxkXWMWWMW0xxOKK000O0N"
               LINE 18 COLUMN 01. 
           05 VALUE "MMXlckK0ooKXK0KXOlxKklxKK00OOO" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMWKklcdkO0XNNWWNNNXNWMWOlokOOddOO0OkkOK00OO00"
               LINE 19 COLUMN 01. 
           05 VALUE "00ddkdoccONNXXKKkllkO0dlOKKXWM" LINE 19 COLUMN 51.
           05 VALUE "MMWXKOkkkOKNWWNNXXKKKKKKKK0KK0kOOxllxlcoddx00OOkkd"
               LINE 20 COLUMN 01. 
           05 VALUE "lckNWKooxk00OOO000OXWKodNMMMMM" LINE 20 COLUMN 51.
           05 VALUE "OOOkdoxOKKKOkOO0KKKXXXXXNXXK00OO0xoddlcodOWMMMMMMM"
               LINE 21 COLUMN 01. 
           05 VALUE "0dKMW0ONWNK00KNMMMMMWKodWMMMMM" LINE 21 COLUMN 51.
           05 VALUE "KXWWWWWWWWWKkKWWWWWMMW0k000K00OokNKKKKXNWWMMMMMMMM"
               LINE 22 COLUMN 01. 
           05 VALUE "0lxXWWWMMMMMMMMMMMMMNOd0WMMMMM" LINE 22 COLUMN 51.
           05 VALUE "WWWWMMMMMMWWWMWWMMWWMWKxkOKXKK0KNWMMMMMMMMMMMMMMMW"
               LINE 23 COLUMN 01. 
           05 VALUE "OokkONMMMMMMMMMMWNKOkOXMMMMMMM" LINE 23 COLUMN 51.
           05 VALUE "WWWMMMMMMMMMMMWWWMMWMWMWKkxkXWWWWMMMMMMMMMMMMMMMMK"
               LINE 24 COLUMN 01. 
           05 VALUE "dOWNxxWMMMMWWNX0xddkNMMMWWNNNN" LINE 24 COLUMN 51.
       01 TELA-07.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 10 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMN0KKXNNNNWMMMMMMMMMMMM"
               LINE 11 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMM0dk00Oxlooodxkdox0NWMMM"
               LINE 12 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MMMMMMNOxkO00OO00KKKNWMMMMWkxWMMWKkOOdlxOdclokNMMM"
               LINE 13 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "MMMMMXolxxxxkO0KKK0OO000KXXdxWMMMMMXOdlllc:;cKMMMM"
               LINE 14 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMMNOoxOxdxkO00000O0OdoxOOXMMMMWWOoocoxl:cckNMMM"
               LINE 15 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMMMXkx0X00000OOkxdollkXWMMWWMN0xOkddlokkO00Okxk0"
               LINE 16 COLUMN 01. 
           05 VALUE "0OOXWKOOOOxkOOOO000XMMMMMMMMMM" LINE 16 COLUMN 51.
           05 VALUE "MMMMNkok0NWMMMWNXKK0OldWWMMMWWKxOXWWNKxdk0NWWNOoOW"
               LINE 17 COLUMN 01. 
           05 VALUE "WNkoodxOXXOdOKklxKOxx0XKK0K000" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMN0Okkkxk0000000kkKKKXNWNdo0K000KKkdodkxdk0XX"
               LINE 18 COLUMN 01. 
           05 VALUE "XNOcdOodKXKxoONOo0MNdo0KK0K00O" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMMWKOkxdk0KNNWWWMMWWNXXWXxdxkOxclxdxxxxkolooo"
               LINE 19 COLUMN 01. 
           05 VALUE "oooxOkdx0KKK0OdccdOxlxKK00000O" LINE 19 COLUMN 51.
           05 VALUE "MMMWXOkkkk0XNWWWWWMMMMMMWMMMMWWWMN0kxdo::coO000XN0"
               LINE 20 COLUMN 01. 
           05 VALUE "dOXNXxxNWXKKK0O0K0dcxNWWWMMMMM" LINE 20 COLUMN 51.
           05 VALUE "MN0xxkKNXKKXXXXXXXKO0KK0KK0KKXNWMWNK0K000KNWMMMMMW"
               LINE 21 COLUMN 01. 
           05 VALUE "xxNMMWK0KK0000KKK0dl0MMMMMMMMM" LINE 21 COLUMN 51.
           05 VALUE "NxdKWWWWWWMMWWWWMWOx0XNNNNXXK0000XWMMMMMMMMMMMMMMM"
               LINE 22 COLUMN 01. 
           05 VALUE "kckNMMMMWWNNNNNNXOdOWMMMMMMMMM" LINE 22 COLUMN 51.
           05 VALUE "xl0WWMMMMWMWWMWWWNXWWWMWWWMWNNWNKkONMMMMMMMMMMMMMW"
               LINE 23 COLUMN 01. 
           05 VALUE "kkOxKWMMMMWNXK0OkOXMMMMMMMMMMM" LINE 23 COLUMN 51.
           05 VALUE "KoOWWMMMWMMMMMWWKkXMMWWWWWMKddk0NKokMMMMMMMMMMMMMW"
               LINE 24 COLUMN 01. 
           05 VALUE "NWWklxO0OkkkkkOKWMMMMMMMWWNNNN" LINE 24 COLUMN 51.
       01 TELA-08.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 10 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMX0KKXNNNNWMMMMMMMMMMMM"
               LINE 11 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMM0dk00Oxlododxkdox0XWMMM"
               LINE 12 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MMMMMMNOxkOO0OO00KKKNWMMMMWkxWMMMKkOOdoxOdclokXMMM"
               LINE 13 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "MMMMMXolxxxxkk0KKK0OO000KXXdxWMMMMMXOdlllc:;cKMMMM"
               LINE 14 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMMNOoxOxdxkO00000O0OdoxOOXMMMMWWOoocoxl:cckNMMM"
               LINE 15 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMMMXkx0X00000OOkxddllkXWMMWWMNOx0kddlokkO00Okxk0"
               LINE 16 COLUMN 01. 
           05 VALUE "0OOXWKOOOOxkOOOO000XMMMMMMMMMM" LINE 16 COLUMN 51.
           05 VALUE "MMMMNkok0NWMMMWNXKK0OldWWMMMWWKxOXWWNKxdk0NWWNOoOW"
               LINE 17 COLUMN 01. 
           05 VALUE "WNkoodxOXXOdOKOlxKOxk0XKK0K000" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMN0Okkkxx000000OxkKKKXNWNdo0K0000Kkdodkxdk0XX"
               LINE 18 COLUMN 01. 
           05 VALUE "XNOldOooKXKxoONOo0MNdo0KK0K00O" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMMNKOkxdk0KNNWWWWWWWNXXWXxdxkOxcldxxxdxkolooo"
               LINE 19 COLUMN 01. 
           05 VALUE "oooxOkdx0KKK0Odc:dOxcxKKK0000O" LINE 19 COLUMN 51.
           05 VALUE "MMMWXOkkkk0XNWWWWWWMMMMMWMMMMWWMMN0kxdo:;cdk00KXN0"
               LINE 20 COLUMN 01. 
           05 VALUE "dOXNXxxNWXKKK0O0K0dcxNWWMMMMMM" LINE 20 COLUMN 51.
           05 VALUE "MNOxkOKNNKKXXXXXXX0O0KK0KK0KKXNWMWNK0K000KNMMMWWMW"
               LINE 21 COLUMN 01. 
           05 VALUE "xxNMMWK0KK0000KKK0dl0MMMMMMMMM" LINE 21 COLUMN 51.
           05 VALUE "NxdXWWWWMMMMWWWWMNOxKNNNNXXKK0000XWMMMMMMMMMMMMMMM"
               LINE 22 COLUMN 01. 
           05 VALUE "kckNMMMMWWNNNNNNXOdOWMMMMMMMMM" LINE 22 COLUMN 51.
           05 VALUE "xl0WWMMMMMMWWMWWWXXWWWMWWWMWNNWNKkONMMMMMMMMMMMMMN"
               LINE 23 COLUMN 01. 
           05 VALUE "OkkxKWMMMWWNXK0OkOXMMMMMMMMMMM" LINE 23 COLUMN 51.
           05 VALUE "KoOWWMMMWMMMMMWM0xXMMWMWWWMKddk0NKokMMMMMMMMMMMMMW"
               LINE 24 COLUMN 01. 
           05 VALUE "NWWklxO0OkxkkkOXWMMMMMMMWWNNNN" LINE 24 COLUMN 51.
       01 TELA-09.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMWX0O0OOOOkkkkOkO00XWMM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMWOdO00ocokkl:clddddOWMM"
               LINE 10 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMMMMNXXNNWMMMMMMMMMMMMMWxxWMWX0xoooolxklcxNMMM"
               LINE 11 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMMMMMWOcokO0000000KXWMMMMMMkdNMMMWWOoxdclllldKKKN"
               LINE 12 COLUMN 01. 
           05 VALUE "MWWWMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MMMMMMKllkOOOO000000O00O0XNKodNMMWXKOddkdlcodO00Ok"
               LINE 13 COLUMN 01. 
           05 VALUE "xO0xkNMMMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "MMMMMWkok0OkxxxkOO00OOOkdlxO0NMMMWxo0XXK0OddXMMMMO"
               LINE 14 COLUMN 01. 
           05 VALUE "oKMKdkWMMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMXxxXMMWXK0O00OOkxxdlxKNMMMMMW0xKWMMMMMW0k0KKK0"
               LINE 15 COLUMN 01. 
           05 VALUE "KWMWxdNMMMMMMMMMMMMMMMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMNxdxx0XKKNMMMWNXK00OdkNWMWMMMNddK0xxxdk00OOkkxo"
               LINE 16 COLUMN 01. 
           05 VALUE "ddxdokXNMMMMMMMMMMMMMMMMMMMMMM" LINE 16 COLUMN 51.
           05 VALUE "MMMWWMN0O0OxkOOO0000000xodO0XWMMWXkkOOocoxxddddl:d"
               LINE 17 COLUMN 01. 
           05 VALUE "KkcdO0OOxk0OOXNWMMMMMMMMMMMMMM" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMXOxdk0KXNNNWNXXXWWWWMMMWKkO0OxooxO0do"
               LINE 18 COLUMN 01. 
           05 VALUE "0kooONNNxxNNkoxkONMMMMMMMMMMMM" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMMMMMWXOkk0NWWWWWWWWWWMMMMMMMMWMXO0K0000NWMXx"
               LINE 19 COLUMN 01. 
           05 VALUE "dkxdx000xx00xxXNxdXWWWWWWWMMMM" LINE 19 COLUMN 51.
           05 VALUE "MMMMMMMMWKxx0NMMMMMWNWMMMMMMMMMMMMMMMMMWWWWMMMMMMO"
               LINE 20 COLUMN 01. 
           05 VALUE "lxXWMWWWWN0dlOK0kkXXXXKKKkOWMM" LINE 20 COLUMN 51.
           05 VALUE "MMMMMMMXkd0WWWMMWWMWXXK0KWMMMMMMMMMWWMMMMMMMMMMMMO"
               LINE 21 COLUMN 01. 
           05 VALUE ":dKXNNK0KK0x:lxxOKKK00000kOWMM" LINE 21 COLUMN 51.
           05 VALUE "MMMMMMMkoXMWWWWWWMMMMMWX0OOXWWWMMMMMMMMMMMMMMMMMWk"
               LINE 22 COLUMN 01. 
           05 VALUE "odoOKXXNXkxk0NMWNNXXXKKXXWMMMM" LINE 22 COLUMN 51.
           05 VALUE "000000KxlOWWWWWWMMMMMMMWWXkokXWMMMMMMMMMMMMMMMMMWN"
               LINE 23 COLUMN 01. 
           05 VALUE "NW0x0K0OOOXMMMMMMMMMMMMMMMMMMM" LINE 23 COLUMN 51.
           05 VALUE "NXK0OxxdccOWWWWWMMMMMMMNKOkooOKXNWMMMMMMMMMMMMMMMM"
               LINE 24 COLUMN 01. 
           05 VALUE "MMMKockXWMMMMMMMMMMMMMMMWWNNNN" LINE 24 COLUMN 51.
       01 TELA-10.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMWX0O0OO0OkkkkOkO00XWMM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMWOdO00ocokkl:clddddOWMM"
               LINE 10 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMMMMNXXNNWMMMMMMMMMMMMMWxxWMWX0xoooolxklcxNMMM"
               LINE 11 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMMMMMWOcokOO000000KXWMMMMMMkdNMMMWWOoxdclllldKKXN"
               LINE 12 COLUMN 01. 
           05 VALUE "MWWWMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MMMMMMKllkOOOOO00000O00O0XNKodNMMWXKOodkdlcodO00Ok"
               LINE 13 COLUMN 01. 
           05 VALUE "xO0xOWMMMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "MMMMMWkok0OkxxxkOO00OOOkdlxOONWMMWxo0XXK0OddXMMMMO"
               LINE 14 COLUMN 01. 
           05 VALUE "oKMKdOWMMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMXxxXMMWXK0O000OOxxdlxKNMMMMMW0xKWMMMMMW0k0KKKO"
               LINE 15 COLUMN 01. 
           05 VALUE "KWMWxdNMMMMMMMMMMMMMMMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMNxdxx0XKKNMMMWNXK00OokNWWWMMMNddK0xxxdk00OOkkxo"
               LINE 16 COLUMN 01. 
           05 VALUE "ddxdokXWMWMMMMMMMMMMMMMMMMMMMM" LINE 16 COLUMN 51.
           05 VALUE "MMMWWMN0O0OxkO000K00O00xodO0XWMMWXkkOOocoxxddddl:d"
               LINE 17 COLUMN 01. 
           05 VALUE "KkcdO0OOxk0OOXNWMMMMMMMMMMMMMM" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMN0xdk0KXNNWWNXXXNWWWMMMWKkO0OxooxO0do"
               LINE 18 COLUMN 01. 
           05 VALUE "0kodONNNxxNNkoxkONMMMMMMMMMMMM" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMMMMMWKOkk0NWWWWWWWWWWMMMWMMMMWMXO0K0000NWMXx"
               LINE 19 COLUMN 01. 
           05 VALUE "dkxdx000xd00xxXNxdXWWWWWWWMMMM" LINE 19 COLUMN 51.
           05 VALUE "MMMMMMMMW0xx0NMMMMMWNWMMMMMMMMMMMMMMMMMWWWWMMMMMMO"
               LINE 20 COLUMN 01. 
           05 VALUE "lxXWMWWWWN0dlOK0kkXXXKKKKkONMM" LINE 20 COLUMN 51.
           05 VALUE "MMMMMMMXkx0WWWMMMMMWXXK0KNMMMMMMMMMWMMMMMMMMMMMMMO"
               LINE 21 COLUMN 01. 
           05 VALUE ":dKXNNK0KK0x:lxxOKKK00000kOWMM" LINE 21 COLUMN 51.
           05 VALUE "MMMMMMMkoXMWWWWWWMMMMMWX0OOXWWWMMMMMMMMMMMMMMMMMWk"
               LINE 22 COLUMN 01. 
           05 VALUE "odoOKXXNXkxk0NWWNNXXXKKXXWMMMM" LINE 22 COLUMN 51.
           05 VALUE "000000KxlOWWWWWWMMMMMMMWWXkokXWMMMMMMMMMMMMMMMMMWN"
               LINE 23 COLUMN 01. 
           05 VALUE "NW0x0K0OOOXMMMMMMMMMMMMMMMMMMM" LINE 23 COLUMN 51.
           05 VALUE "NXK0OkxdlcOWWWWWMMMMMMWNKOkooOKXNNWMMMMMMMMMMMMMMM"
               LINE 24 COLUMN 01. 
           05 VALUE "MMMKocxXWMMMMMMMMMMMMMMMWWNNNN" LINE 24 COLUMN 51.
       01 TELA-11.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWWWWN000OOKWX00NMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMW0kOO0kddOxlcloddlkMMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMKoOWMMNO00xxkdldxlOMMM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMMX0O00KNWMMMMMMMMMMMM0dKMWMMMWxkNXx;dKddKKN"
               LINE 10 COLUMN 01. 
           05 VALUE "WMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMMWklldkOOO0OO0XWMMMMMMMNdkWWMMMWkxOkdlodxk00O"
               LINE 11 COLUMN 01. 
           05 VALUE "kk0XNMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMMMMNkoxxodkO0KXK0OOO0XWMMMNddNMMMMNkccoxxdx0WMMW"
               LINE 12 COLUMN 01. 
           05 VALUE "koO0x0WMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MN0OOOONWX00OxooxkO00OkOOO0OxOXWMMMMKod0XNMWX00K00"
               LINE 13 COLUMN 01. 
           05 VALUE "OXWKoxWMMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "WKxxdkKNMMMMWXK0OOkxolxXXdckNMMMMMMXxkXK0OO0K0kkxx"
               LINE 14 COLUMN 01. 
           05 VALUE "OK0dOWMMMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMXkodOO0NMMMMMMWNXdlOOclKWMMMMWM0odkkxll0Kkxxxd"
               LINE 15 COLUMN 01. 
           05 VALUE "kOdkWMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMMMMNXK0OkkkOO00KXNxkXxdkO0KXNWMMWKkk0KxcollloKW"
               LINE 16 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 16 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMXOOOxkOxocoddO0XWNXNWMMMMWKOOOxdx00dOW"
               LINE 17 COLUMN 01. 
           05 VALUE "WX0OOOKXKKNMMMMMMMMMMMMMMMMMMM" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMWXOOOOOKXNWWWMMMMMMMMMMMMMWWNWMWWKod"
               LINE 18 COLUMN 01. 
           05 VALUE "dlxKKOox0OxkOKNMMMMMMMMMMMMMMM" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMNOkk0XWWMMWMMMMMMMMMMMMMMMMMMWWMMMWW0o"
               LINE 19 COLUMN 01. 
           05 VALUE "doxKKOoOMMOoOkxKMMMMMMMMMMMMMM" LINE 19 COLUMN 51.
           05 VALUE "MMMMMMMMMMW0xkXWMMMWWMMMMMMMMMMMMMMMMMMMMMMMMMMMWx"
               LINE 20 COLUMN 01. 
           05 VALUE "cdk00OkOOkx0WWxdNWMMMMMMMMMMMM" LINE 20 COLUMN 51.
           05 VALUE "MMMMMMMMMNxdXWMMMMMWMMMMMWNWMMMMMWXKNMMMMMMMMMMMMk"
               LINE 21 COLUMN 01. 
           05 VALUE ":dKXKKKKxcoO0OxkKXXKKKK0NMMMMM" LINE 21 COLUMN 51.
           05 VALUE "MMMMMMMMMOoKMWMMMMWWWMMMMWKO0XKKKK0KWMMMMMMMMMMMWK"
               LINE 22 COLUMN 01. 
           05 VALUE "00odOkOkxolodkOKXXXXXKOodNMMMM" LINE 22 COLUMN 51.
           05 VALUE "000000KKXxoXMWMMMMMMMMMWWMW0od0KNWMMMMMMMMMMMMMMMM"
               LINE 23 COLUMN 01. 
           05 VALUE "MWklddxxdkXWWNXXKK0K0000XMMMMM" LINE 23 COLUMN 51.
           05 VALUE "NXK0Okxxxd:dNWWMMMMMWWWWWNKOookkkOXWMMMMMMMMMMMMMM"
               LINE 24 COLUMN 01. 
           05 VALUE "MM0xxldXWMMMMMMMMMMMMMMMWWNNNN" LINE 24 COLUMN 51.
       01 TELA-12.
           
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 02 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 02 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 03 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 03 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 04 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 04 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 05 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 05 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM"
               LINE 06 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 06 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMWWWWN0O0OOKWX00NMMM"
               LINE 07 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 07 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMW0kOO0OddkxolloddlkMMM"
               LINE 08 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 08 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMKoOWWMNO0OdxkdldxlOMMM"
               LINE 09 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 09 COLUMN 51.
           05 VALUE "MMMMMMMMX0OO0KNWMMMMMMMMMMMM0dKMWMMMWxkNXx;dKddKKN"
               LINE 10 COLUMN 01. 
           05 VALUE "WMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 10 COLUMN 51.
           05 VALUE "MMMMMMWklldkOOO0OO0XWMMMMMMMNdkWMMMMWOx0kdlodxk00O"
               LINE 11 COLUMN 01. 
           05 VALUE "kk0XNMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 11 COLUMN 51.
           05 VALUE "MMMMMNkoxxodkO0KXK0OOO0XWMMMNddNMMMMNkccoxxdx0WMMW"
               LINE 12 COLUMN 01. 
           05 VALUE "koOOx0WMMMMMMMMMMMMMMMMMMMMMMM" LINE 12 COLUMN 51.
           05 VALUE "MN0OOOONWX00OxooxkO00OkOOO0OxkXWMMMMKdd0XNMWX00K00"
               LINE 13 COLUMN 01. 
           05 VALUE "OXWKoxWMMMMMMMMMMMMMMMMMMMMMMM" LINE 13 COLUMN 51.
           05 VALUE "WKxxdkKNMMMMWNK00OkxooxXXdlkNWWWMMMXxkKKKOO0K0kkxx"
               LINE 14 COLUMN 01. 
           05 VALUE "OK0dkWMMMMMMMMMMMMMMMMMMMMMMMM" LINE 14 COLUMN 51.
           05 VALUE "MMMMXkodOO0NMMMMMMWNKdoOOclKWMMMMWM0odkkxll0Kkxxxd"
               LINE 15 COLUMN 01. 
           05 VALUE "xOxkWMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 15 COLUMN 51.
           05 VALUE "MMMMMMNXK0OkkkOO00KXWxkXxdkO0KXNWWMWKkk0KdcollloKW"
               LINE 16 COLUMN 01. 
           05 VALUE "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMM" LINE 16 COLUMN 51.
           05 VALUE "MMMMMMMMMMMWXOOOxkOxocoxok0XWNXNWMMMMWKOOOxdx0OdOW"
               LINE 17 COLUMN 01. 
           05 VALUE "WX0OOOKXKKNMMMMMMMMMMMMMMMMMMM" LINE 17 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMMMWX0OOOOKXNWWWWMMWMMMMMMMMMWWNWMWWKdd"
               LINE 18 COLUMN 01. 
           05 VALUE "xlxKKOox0OxkOKNMMMMMMMMMMMMMMM" LINE 18 COLUMN 51.
           05 VALUE "MMMMMMMMMMMMN0kk0XWMWWWMMMMMMMMMMMMMMMMMMMMMMMWW0o"
               LINE 19 COLUMN 01. 
           05 VALUE "doxKKOoOWMOoOkxKMMMMMMMMMMMMMM" LINE 19 COLUMN 51.
           05 VALUE "MMMMMMMMMMW0xkXWMWWWWMWMMMMMMMMMMMMMMMMMMMMMMMMMWx"
               LINE 20 COLUMN 01. 
           05 VALUE "cdk00OkOOkx0WWxdNWMMMMMMMMMMMM" LINE 20 COLUMN 51.
           05 VALUE "MMMMMMMMMNxdKWMMMWWWMMMMMWNWMMMMMWXKNMMMMMMMMMMMMk"
               LINE 21 COLUMN 01. 
           05 VALUE ":oKXKKXKxcoO0OxkKKXKKKK0NMMMMM" LINE 21 COLUMN 51.
           05 VALUE "MMMMMMMMMOoKMMMMMMWWMMMMMN0O0XKKK00KWMMMMMMMMMMMMK"
               LINE 22 COLUMN 01. 
           05 VALUE "00odOkOkxolodxOKXXXXXK0odNMMMM" LINE 22 COLUMN 51.
           05 VALUE "000000KKXkoKMWMMMMMMMMMWWMWKdd0KNWMMMMMMMMMMMMMMMM"
               LINE 23 COLUMN 01. 
           05 VALUE "MWklddxxdkXMWNXXK00K0000XMMMMM" LINE 23 COLUMN 51.
           05 VALUE "NXK0Okxxxd:xNWWMMMMMWMMWWNKOookkxOXWMMMMMMMMMMMMMM"
               LINE 24 COLUMN 01. 
           05 VALUE "MM0xxldKWMMMMMMMMMMMMMMMWWNNNN" LINE 24 COLUMN 51.

       PROCEDURE DIVISION.
       P-INICIO.
           DISPLAY TELA-12.

       P-TROCA-TELA.

           DIVIDE WS-TEMPORIZADOR BY 12 GIVING WS-DIVISAO
               REMAINDER WS-RESTO

           IF WS-TEMPORIZADOR NOT = 0 AND WS-RESTO = 1
               DISPLAY TELA-01
           ELSE IF WS-RESTO = 2
               DISPLAY TELA-02
           ELSE IF WS-RESTO = 3
               DISPLAY TELA-03
           ELSE IF WS-RESTO = 4
               DISPLAY TELA-04
           ELSE IF WS-RESTO = 5
               DISPLAY TELA-05
           ELSE IF WS-RESTO = 6
               DISPLAY TELA-06
           ELSE IF WS-RESTO = 7
               DISPLAY TELA-07
           ELSE IF WS-RESTO = 8
               DISPLAY TELA-08
           ELSE IF WS-RESTO = 9
               DISPLAY TELA-09
           ELSE IF WS-RESTO = 10
               DISPLAY TELA-10
           ELSE IF WS-RESTO = 11
               DISPLAY TELA-11
           ELSE IF WS-RESTO = 0
               DISPLAY TELA-12.

           ADD 1 TO WS-TEMPORIZADOR
               IF WS-TEMPORIZADOR < 10000
               GO TO P-TROCA-TELA.    
       P-PARADA.
           DISPLAY TELA-01.
       P-FIM-EXIT.
           EXIT PROGRAM.
       P-FIM-STOP-RUN.
           STOP RUN.